Revit 2026 API

# AnalyticalModelSelector Properties

---

The AnalyticalModelSelector type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveSelector | The portion of the curve to be selected. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

AnalyticalModelSelector Class

Autodesk.Revit.DB.Structure Namespace